tests/shockTube/mhdCentralFoam/BrioWuShockTube/0.orig/B
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -2 0 0 -1 0];

internalField   uniform (0 1 0);

boundaryField
{
    sides
    {
        type            zeroGradient;
    }

    front
    {
        type            cyclic;
    }
    
    back
    {
        type            cyclic;
    }
    
    lowerWall
    {
        type            zeroGradient;
        //value           uniform (0 1 0);
    }

    upperWall
    {
        type            zeroGradient;
        //value           uniform (0 1 0);
    }   
}

// ************************************************************************* //
