tests/shockTube/mhdCentralFoam/BrioWuShockTube/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoU|rhoE)"
    {
        solver          diagonal;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        //solver          smoothSolver;
        //smoother        GaussSeidel;
        //nSweeps         2;
        tolerance       1e-09;
        relTol          0;
    }

    "(h|e)"
    {
        $U;
        tolerance       1e-10;
        relTol          0;
    }
    
    B
    {
        $U
        //solver          smoothSolver;
        //smoother        GaussSeidel;
        //nSweeps         2;
        tolerance       1e-09;
        relTol          0;//0.01;
    }
    
    pB
    {
        $U
        //solver          smoothSolver;
        //smoother        GaussSeidel;
        //nSweeps         2;
        tolerance       1e-09;
        relTol          0;//0.01;
    }
}


// ************************************************************************* //
